Repository: sakeven/Selected
Catalog: Selected/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Requires Selected %@ or later. The current version is %@.
zh_hans: 需要 Selected %@ 或更新版本，当前为 %@。

source: Restore original selection
zh_hans: 恢复原选区

source: Restore Previous Version
zh_hans: 恢复上一版本

source: Restore the previous version? This replaces the current plugin definition and keeps your settings.
zh_hans: 恢复上一版本？当前插件定义将被替换，个人参数保留。

source: Result
zh_hans: 处理结果

source: Resume
zh_hans: 恢复

source: Retry
zh_hans: 重试

source: Review compatibility before adding the plugin to Selected.
zh_hans: 检查兼容性后，将插件添加到 Selected。

source: Rich Text
zh_hans: 富文本

source: rich text format
zh_hans: 富文本

source: Run AI
zh_hans: 运行 AI

source: Run Command
zh_hans: 运行命令

source: Run failed
zh_hans: 运行失败

source: Running
zh_hans: 正在运行

source: Running…
zh_hans: 正在运行…

source: Sample Clipboard Text
zh_hans: 示例剪贴板文本

source: Sample Text
zh_hans: 示例文本

source: Save
zh_hans: 保存

source: Save and Reload
zh_hans: 保存并重新加载

source: Save Changes
zh_hans: 保存更改

source: Save this value
zh_hans: 保存此参数

source: Save to Keychain
zh_hans: 保存到系统钥匙串

source: Saved
zh_hans: 已保存

source: Schema Version
zh_hans: 协议版本

source: Search
zh_hans: 搜索

source: Search actions or plugins
zh_hans: 搜索动作或插件

source: Search apps, files, and more…
zh_hans: 搜索应用、文件等内容…

source: Search in this category
zh_hans: 在此分类中搜索

source: Search URL
zh_hans: 搜索地址

source: Searching files…
zh_hans: 正在搜索文件…

source: Secret
zh_hans: 密钥

source: select an action
zh_hans: 选择一个操作

source: select one app
zh_hans: 选择一个应用

source: Selected action
zh_hans: Selected 动作

source: Set up your AI provider and API key in General settings first.
zh_hans: 请先在通用设置中配置 AI 服务和 API 密钥。

source: Settings
zh_hans: 设置

source: share
zh_hans: 分享

source: Show and Allow Replacement
zh_hans: 显示并允许替换

source: Show in Finder
zh_hans: 在 Finder 中显示

source: Show in Finder (⌘↩)
zh_hans: 在 Finder 中显示 (⌘↩)

source: Show Only in These Apps · Comma-separated bundle IDs
zh_hans: 仅在这些应用显示 · 逗号分隔 bundle ID

source: Show Result
zh_hans: 显示结果

source: Single Choice
zh_hans: 单选

source: Sources
zh_hans: 来源

source: Speak
zh_hans: 朗读

source: Spotlight
zh_hans: 聚焦

source: Spotlight HotKey
zh_hans: 聚焦的快捷键

source: Stable Identifier
zh_hans: 稳定标识

source: Stable Plugin Identifier
zh_hans: 插件稳定标识

source: Start with an action and make it work your way.
zh_hans: 从一个动作开始，按你的方式工作。

source: Stop
zh_hans: 停止

source: success
zh_hans: 成功

source: Summarize the following: {{selected.text}}
zh_hans: 请总结以下内容： {{selected.text}}

source: Summary
zh_hans: 简介

source: Switching to the visual editor parses and validates the YAML. Saving reformats it and removes comments.
zh_hans: 切回可视化会解析并校验；保存时重新排版，不保留注释。

source: system
zh_hans: 系统

source: tagged image file format
zh_hans: 标签图像文件格式

source: Test
zh_hans: 试运行

source: Test Action
zh_hans: 试运行动作

source: Test Plugin
zh_hans: 插件试运行

source: Text
zh_hans: 文本

source: Text can be pasted
zh_hans: 可粘贴文本

source: Text content needs to be entered.
zh_hans: 需要输入文本信息。

source: Text is selected
zh_hans: 有选中文本

source: Text Regular Expression
zh_hans: 文本正则表达式

source: Text Regular Expression · Optional
zh_hans: 文本正则表达式 · 可选

source: The action identifier cannot be empty.
zh_hans: 动作标识不能为空。

source: The action title cannot be empty.
zh_hans: 动作标题不能为空。

source: The archive contains an invalid resource path.
zh_hans: 压缩包中包含无效的资源路径。

source: The command runs locally. Results stay here instead of being pasted or copied.
zh_hans: 命令会在本机运行，结果显示在这里，不会自动粘贴或复制。

source: The command timed out after 60 seconds.
zh_hans: 命令运行超过 60 秒，已超时。

source: The identifier of an installed plugin cannot be changed.
zh_hans: 已安装插件的标识不可更改。

source: The installation folder already exists.
zh_hans: 安装目录已存在。

source: The installation folder is already used by another plugin: %@.
zh_hans: 安装目录已被其他插件占用：%@。

source: The item may have moved or is no longer accessible.
zh_hans: 项目可能已移动或无法访问。

source: The macOS service could not complete the action.
zh_hans: macOS 服务未能完成此操作。

source: The new version must be higher than the installed version %@.
zh_hans: 新版本必须高于已安装版本 %@。

source: The original app is no longer available. Copy the result instead.
zh_hans: 原应用已退出，请复制结果后使用。

source: The original attachment is retained for retry.
zh_hans: 重试时会沿用原附件。

source: The original package is preserved. Options use Selected's settings and local Keychain.
zh_hans: 保留原始插件包，参数使用 Selected 设置和本机钥匙串存储。

source: The original text could not be verified after restoring. Check the original app.
zh_hans: 无法确认原文已恢复，请检查原应用。

source: The original text has changed. Copy the result or paste at the current cursor.
zh_hans: 原文已发生变化，请复制结果或粘贴到当前光标位置。

source: The plugin changed while you were editing. Please reopen the editor.
zh_hans: 插件已在编辑期间发生变化，请重新打开编辑器。

source: The plugin identifier can contain only letters, numbers, dots, and hyphens, and must start with a letter or number.
zh_hans: 插件标识只能包含字母、数字、点和连字符，且须以字母或数字开头。

source: The plugin name cannot be empty.
zh_hans: 插件名称不能为空。

source: The plugin package exceeds the 50 MB import limit.
zh_hans: 插件包超过 50 MB 导入限制。

source: The PopClip configuration must be a dictionary.
zh_hans: PopClip 配置必须是字典结构。

source: The previous version has a different plugin identifier.
zh_hans: 历史版本的插件标识不一致。

source: The previous version is kept after editing or updating. Your settings are saved separately.
zh_hans: 编辑或更新后会保留上一版本，个人参数独立保存。

source: The previous version is saved. Restore it from the More menu.
zh_hans: 已保留上一版本，可通过“更多”菜单恢复。

source: The sample is sent to your configured AI provider. Results stay here instead of being pasted or copied.
zh_hans: 示例文本将发送给已配置的 AI 服务，结果显示在这里，不会自动粘贴或复制。

source: The text does not match the regular expression.
zh_hans: 文本不匹配正则表达式。

source: The text has changed since replacement. The original is still available to copy.
zh_hans: 替换后文字又发生了变化，你仍可以复制保留的原文。

source: This action is hidden in the selected app.
zh_hans: 此动作在所选应用中隐藏。

source: This action is not enabled for the selected app.
zh_hans: 此动作未在所选应用中启用。

source: This action may call its configured AI tools during the test.
zh_hans: 试运行时，此动作可能调用已配置的 AI 工具。

source: This action needs a live selection in the original app.
zh_hans: 此动作需要在原应用中选中文字后运行。

source: This action requires an editable text field.
zh_hans: 此动作需要可编辑的文本区域。

source: This app cannot restore the selection. Paste at the current cursor instead.
zh_hans: 此应用不支持恢复选区，请粘贴到当前光标位置。

source: This app or webpage is excluded by the shortcut's matching rules.
zh_hans: 此应用或网页不符合快捷键的匹配规则。

source: This first release supports declarative URL, keyboard shortcut, and plain-text macOS service actions. Script runtimes and other unsupported capabilities are listed above.
zh_hans: 首批支持声明式 URL、快捷键和纯文本 macOS 服务动作。上方列出了暂不支持的脚本运行环境及其他能力。

source: This replaces the current definition, including local edits. Your settings and a previous-version backup are kept.
zh_hans: 将替换当前插件定义，包括本地修改；保留个人参数和上一版本备份。

source: Toggle
zh_hans: 开关

source: tool
zh_hans: 工具

source: Tool Call List
zh_hans: 工具调用列表

source: Translate to Chinese
zh_hans: 翻译到中文

source: Translate to English
zh_hans: 翻译到英文

source: Translation
zh_hans: 翻译

source: TTS Instructions
zh_hans: TTS 指令

source: TTS Model
zh_hans: TTS 模型

source: Type or paste text…
zh_hans: 输入或粘贴文本…

source: Unknown
zh_hans: 未知

source: Unsupported or invalid PopClip field: %@
zh_hans: 不支持或无效的 PopClip 字段：%@

source: Unsupported PopClip key target: %@
zh_hans: 暂不支持此 PopClip 按键目标：%@

source: Unsupported PopClip requirement: %@
zh_hans: 暂不支持此 PopClip 条件：%@

source: Unsupported schemaVersion %lld. The supported version is 1.
zh_hans: 不支持 schemaVersion %lld，当前支持版本为 1。

source: Untitled Action
zh_hans: 未命名动作

source: Untitled Plugin
zh_hans: 新插件

source: Unversioned
zh_hans: 未标记版本

source: URL Template
zh_hans: 链接模板

source: URL template: {selected.clipboardText}
zh_hans: URL 模板：{selected.clipboardText}

source: URL, shortcut, and service actions are previewed here without opening apps or sending keystrokes.
zh_hans: URL、快捷键和系统服务仅显示预览，不会打开应用或发送按键。

source: URL:
zh_hans: 链接：

source: Use {{selected.text}} to insert selected text and {{options.identifier}} to insert an option value.
zh_hans: 使用 {{selected.text}} 插入选中文字，{{options.标识}} 插入选项值。

source: Use {selected.text} for selected text and {selected.options.identifier} for an option value.
zh_hans: {selected.text} 表示选中文字，{selected.options.标识} 表示选项值。

source: Used for apps without their own configuration
zh_hans: 应用未单独配置时使用

source: user
zh_hans: 用户

source: Uses the AI model and provider from General settings
zh_hans: 使用通用设置中的 AI 模型与服务

source: Version
zh_hans: 版本

source: Version %@
zh_hans: 版本 %@

source: View Original Source
zh_hans: 查看原始源码

source: Visual
zh_hans: 可视化

source: Voice
zh_hans: 声音

source: waiting
zh_hans: 等待中

source: Web search
zh_hans: 网络搜索

source: Webpage URL
zh_hans: 网页地址

source: What can this plugin help you do?
zh_hans: 这个插件可以帮你做什么？

source: Workdir
zh_hans: 工作目录

source: You can also use text icons or files in the plugin package, such as file://./icon.png.
zh_hans: 图标也支持文本图标和包内文件，例如 file://./icon.png。

source: You can switch apps while this runs.
zh_hans: 处理期间可以继续使用其他应用。
